app/Controllers/Admin/ClientController.php

    public function index()
    {
        $clients = (new User())->where('role', User::ROLE_CLIENT)->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'client'

    public function store()
    {
        $validator = $this->validator(true);

        if (!$validator->run($this->request->getVar())) {
            return redirect()->back()->withInput()->with('errors', $validator->getErrors());
        }

        (new User())->insert(array_merge($this->request->getVar(), [
            "role"     => User::ROLE_CLIENT,
            "password" => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
        ]));
---
INSERT INTO `users` (`name`, `username`, `email`, `password`, `phone`, `address`, `role`) VALUES ('Payas Agung22', 'client12322123', 'coclientt12345@gmail.com', '$2y$10$FC.Xk.yIFDdGufBl7.IaROdMATBxO6BKgGSxy70u29pLNpMhfDUDG', '087772818234', '12423424123JALANANAN', 'client')

    public function edit($clientId)
    {
        $client = (new User())->where('id', $clientId)->where('role', User::ROLE_CLIENT)->first();
---
SELECT *
FROM `users`
WHERE `id` = '8'
AND `role` = 'client'
 LIMIT 1

    public function destroy($clientId)
    {
        (new User())->delete($clientId);
---
DELETE FROM `users`
WHERE `id` IN ('8')