app/Controllers/Admin/ConsultantController.php

SELECT *
FROM `users`
WHERE `id` = '2'
AND `role` = 'consultant'
 LIMIT 1
---
    public function edit($consultantId)
    {
        $consultant = (new User())->where('id', $consultantId)->where('role', User::ROLE_CONSULTANT)->first();